Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_MS_FocSolution_F16.h"
#include "Ifx_MS_FocSolution_F16_Cfg.h"

/* C library */
#include "stddef.h"

/* Math library includes */
#include "Ifx_Math_Arithmetic_F16.h"
#include "Ifx_Math_CartToPolar.h"
#include "Ifx_Math_Clarke.h"
#include "Ifx_Math_Park.h"
#include "Ifx_Math_PolarToCart.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/
/* Macro to saturate the value with wrapping */
#define IFX_MS_FOCSOLUTION_F16_2MAX                              (-2 * IFX_MATH_FRACT16_MIN)

/* Represents -PI in signed 16-bit */
#define IFX_MS_FOCSOLUTION_F16_PINEG                             (IFX_MATH_FRACT16_MIN + 1)

/* 30 degrees in Q32 */
#define IFX_MS_FOCSOLUTION_F16_PIBY6                             (IFX_MATH_PI_INDEX / 6U)

/* 90 degrees in Q32 */
#define IFX_MS_FOCSOLUTION_F16_PIBY2                             (IFX_MATH_PI_INDEX / 2U)

/* Macro for transition mode when mode is direct transition */
#define IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_DIRECT_TRANSITION (0)

/* Macro for transition mode when mode is smooth transition */
#define IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION (1)

/* Macro to define number of decimal places parameters with variable Q formats */
#define IFX_MS_FOCSOLUTION_F16_DEC_PLACES                        10000

/* *INDENT-OFF* */
/* Macros to define the component ID */
#define IFX_MS_FOCSOLUTION_F16_COMPONENTID_SOURCEID \
    ((uint8_t) Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTID_LIBRARYID      ((uint16_t)Ifx_ComponentID_LibraryID_mctrlSolution)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTID_MODULEID       (0U)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTID_COMPONENTID1   (1U)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTID_COMPONENTID2   ((uint8_t)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_MAJOR     (2U)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_MINOR     (0U)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_PATCH     (0U)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_T         (4U)
#define IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_REV       (0U)
/* *INDENT-ON* */
/******************************************************************************/
/*-----------------------Private Function Prototypes--------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Initialization functions called by Ifx_MS_FocSolution_F16_init() */
void               Ifx_MS_FocSolution_F16_initModules(Ifx_MS_FocSolution_F16* self,
                                                      Ifx_MS_FocSolution_F16_ParamComposition* paramComposition);
static inline void Ifx_MS_FocSolution_F16_initDriveAlgo(Ifx_MS_FocSolution_F16* self,
                                                        Ifx_MS_FocSolution_F16_ParamComposition* paramComposition);
static inline void Ifx_MS_FocSolution_F16_initSpeedPi(Ifx_MS_FocSolution_F16* self);
static inline void Ifx_MS_FocSolution_F16_initSpeedAccelerationLimiters(Ifx_MS_FocSolution_F16* self);
static inline void Ifx_MS_FocSolution_F16_initStartCurrentRateLimiter(Ifx_MS_FocSolution_F16* self);

/* Functions called by Ifx_MS_FocSolution_F16_executeControlMode() */

/* Calls the DriverGroup APIs to measure and to get the reconstructed currents and DC-Link voltage, stores the current 
 * reconstruction information for the next cycle, calls the Math API to perform the Clarke transformation from UVW to 
 * alpha-beta and returns the reconstructed currents and DC-Link voltage */
static inline Ifx_MHA_DriverGroup_F16_Output Ifx_MS_FocSolution_F16_measureAndReconstruct(Ifx_MS_FocSolution_F16* self);

/* Calls the FluxEstimator APIs to perform the estimation of the speed/position, stores the voltage in alpha beta format
 * for the next cycle, assigns the estimated speed to the output and returns the estimated angle */
static inline uint32_t              Ifx_MS_FocSolution_F16_fluxEstimation(Ifx_MS_FocSolution_F16* self);

/* Checks if the Q command has changed its sign and potentially calls the private API for rotating the ref. DQ system, 
 * calls the private APIs for openLoop/closedLoop depending on the current subState and executes the FocController and 
 * returns its calculated output voltage command */
static inline Ifx_Math_PolarFract16 Ifx_MS_FocSolution_F16_regulationLoop(Ifx_MS_FocSolution_F16* self,
                                                                          uint32_t estimatedAngle, Ifx_Math_Fract16
                                                                          dcLinkVoltageQ15);

/* Implement voltage generation by calling the Modulator execute function and passing on the calculated compare values
 * and trigger times to the DriverGroup. Use the Modulator output to update the current reconstruction information and
 * and to convert the output voltage to cartesian (voltageAlphaBeta) for the flux estimation in the next cycle. */
static inline void Ifx_MS_FocSolution_F16_voltageGeneration(Ifx_MS_FocSolution_F16       * self,
                                                            Ifx_Math_PolarFract16          voltageCommandPolar,
                                                            Ifx_MHA_DriverGroup_F16_Output driverGroupOutput);
/* *INDENT-ON* */
static void Ifx_MS_FocSolution_F16_stateMachine(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15,
                                                Ifx_Math_CmpFract16 currentsDqRef);

/* State functions called by Ifx_MS_FocSolution_F16_stateMachine function */
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateInit(Ifx_MS_FocSolution_F16* self);
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateOff(Ifx_MS_FocSolution_F16* self, bool
                                                                           faultStatus);
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStandby(Ifx_MS_FocSolution_F16* self, bool
                                                                               faultStatus);
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateFault(Ifx_MS_FocSolution_F16* self);

/* State transition functions called by Ifx_MS_FocSolution_F16_stateStandby */

