Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
/* Implements the transition from StandBy to Off. Calls localEnable to disable all underlying modules,
 * checkModulesStateOff to check whether all underlying modules are in off state and returns the nextState
 * accordingly. */
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStandbyToOff(Ifx_MS_FocSolution_F16* self);

/* Implements the transition from StandBy to Run. Updates the control mode using getControlMode, sets the open loop ramp
 * up/down rates of the Math AccelLimit component, initializes the substate machine to openLoop, enables the
 * FluxEstimator component and returns the nextState run. */
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStandbyToRun(Ifx_MS_FocSolution_F16* self);

/* Functions called by Ifx_MS_FocSolution_F16_stateFault() */
/* Requests a clear fault of the underlying modules */
static inline bool Ifx_MS_FocSolution_F16_clearModuleFaults(Ifx_MS_FocSolution_F16* self);
static inline bool Ifx_MS_FocSolution_F16_clearModuleFaultsMHA(Ifx_MS_FocSolution_F16* self);
static inline void Ifx_MS_FocSolution_F16_clearModuleFaultsMAS(Ifx_MS_FocSolution_F16* self);

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
static inline void Ifx_MS_FocSolution_F16_clearModuleFaultsMDA(Ifx_MS_FocSolution_F16* self);
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
/* Returns true if any module has a clear fault pending and false otherwise */
static inline bool Ifx_MS_FocSolution_F16_anyClearFaultIsPending(Ifx_MS_FocSolution_F16* self);

/* Check if all faults of the underlying module are successfully cleared */
static inline bool Ifx_MS_FocSolution_F16_faultSuccessfullyCleared(
    Ifx_MS_FocSolution_F16* self);
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateRun(Ifx_MS_FocSolution_F16* self,
                                                                           Ifx_Math_Fract16 speedQ15, bool
                                                                           faultStatus, Ifx_Math_CmpFract16
                                                                           currentsDqRef);
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateRampDown(Ifx_MS_FocSolution_F16* self, bool
                                                                                faultStatus, Ifx_Math_CmpFract16
                                                                                currentsDqRef);

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStartAngleIdent(Ifx_MS_FocSolution_F16* self,
                                                                                       Ifx_Math_Fract16 speedQ15, bool
                                                                                       faultStatus,
                                                                                       Ifx_MDA_IToFController_F16_Output
                                                                                       iToFOutput);

/* Set angle previous value of iToF controller to the estimated angle minus pi/2 offset and tolerance based on the sign
 * of the reference speed */
void Ifx_MS_FocSolution_F16_setAnglePreviousValue(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15,
                                                  Ifx_MDA_StartAngleIdent_F16_Output startAngleIdentOutput);
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
/* Execute the sub-state machine */
static inline void Ifx_MS_FocSolution_F16_subStateMachine(Ifx_MS_FocSolution_F16* self, Ifx_Math_CmpFract16
                                                          currentsDqRef);

/* State functions called by Ifx_MS_FocSolution_F16_subStateMachine function */
static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateOpenLoop(Ifx_MS_FocSolution_F16* self,
                                                                                      Ifx_MDA_IToFController_F16_Output
                                                                                      iToFOutput, Ifx_Math_CmpFract16
                                                                                      currentsDqRef);

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)
static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateTransitUp(Ifx_MS_FocSolution_F16* self,
                                                                                       Ifx_MDA_IToFController_F16_Output
                                                                                       iToFOutput, Ifx_Math_CmpFract16
                                                                                       currentsDqRef);

/* Implements the transition from transitionUp to closedLoop. Sets the q current command by calling currentQRef, sets
 * the Acceleration Limit ramp up/down rates to closed loop and returns the next state closedLoop. */
static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateTransitUpExit(
    Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 estimatedSpeedQ15, Ifx_Math_CmpFract16 currentsDqRef);

/* *INDENT-OFF* */
static inline
Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateTransitDown(Ifx_MS_FocSolution_F16 *self,
                                                                           Ifx_MDA_IToFController_F16_Output iToFOutput,
                                                                           Ifx_Math_CmpFract16 currentsDqRef);
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */

static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateClosedLoop(Ifx_MS_FocSolution_F16* self,
                                                                                        Ifx_Math_CmpFract16
                                                                                        currentsDqRef);

/* Calculates the d current for smooth transition down based on the absolute estimated speed, the transitionSpeedMid
 * and the target d current for transition down. The d current shall ramp up linearily from 0 to the target d current as
 * the estimated speed ramps down from transitionSpeedMid to transitionSpeedDown. */
static inline void Ifx_MS_FocSolution_F16_smoothTransitionDownCalc(Ifx_MS_FocSolution_F16* self,
                                                                   Ifx_Math_Fract16 estimatedSpeedAbsQ15);
/* *INDENT-ON* */

/* Implements the transition from closedLoop to openLoopReset and sets/resets the following:
 *  - IToF previous angle to last flux estimator angle
 *  - Acceleration Limit state to the last estimated speed
 *  - Acceleration Limit ramp up/down rates to open loop
 * Additionally, it stores the last ref. q current to calculate the slope in subStateTransitDown, and resets the
 * transition counter. It returns the next state transitionDown in case smooth transition is enabled, or openLoop if
 * disabled. */
static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateClosedLoopExit(
    Ifx_MS_FocSolution_F16* self);

/* Implement open loop by calling the IToF controller with the normalized rate limited speed to generate and set the
 * angle */
static inline void Ifx_MS_FocSolution_F16_openLoop(Ifx_MS_FocSolution_F16* self);

