Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
/* Implement closed loop by setting the angle to the input parameter which shall be set to the output angle of the flux
 * estimator */
static inline void Ifx_MS_FocSolution_F16_closedLoop(Ifx_MS_FocSolution_F16* self, uint32_t fluxEstimatorAngle);

/* Execute the fast loop operations with VToF */
static inline Ifx_Math_PolarFract16 Ifx_MS_FocSolution_F16_vToFLoop(Ifx_MS_FocSolution_F16* self);

/* Reset the previous values of this component and underlying components to their initial values. Reset the rate limited
 * input speed and the previous current reconstruction info directly and reset the Q current command to the initial
 * startup current. Reset the underlying components by calling their respective APIs, this includes:
 *  - Low Pass Filters of the flux estimator
 *  - PLL of the flux estimator
 *  - Speed PI controller
 *  - FocController
 *  - Acceleration Limiter
 *  - Rate Limiter (reset to the initial startup current) */
static void Ifx_MS_FocSolution_F16_reset(Ifx_MS_FocSolution_F16* self);

/* Fault check for all the modules */
static bool Ifx_MS_FocSolution_F16_faultStatus(Ifx_MS_FocSolution_F16* self);

/* API to enable / disable all the modules */
static void Ifx_MS_FocSolution_F16_localEnable(Ifx_MS_FocSolution_F16* self, bool enable);

/* Apply the Math Limit and AccelLimit components on the input speed and set the rate limited speed accordingly */
static inline void Ifx_MS_FocSolution_F16_limitSpeed(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15);

/* Check if all modules are in the on state */
static inline bool Ifx_MS_FocSolution_F16_checkModulesStateOn(Ifx_MS_FocSolution_F16* self);

/* Calculate and return the speed error in Q14 format */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_calcSpeedErrorQ14(Ifx_Math_Fract16 rateLimitInSpeedQ15,
                                                                        Ifx_Math_Fract16 estimatedSpeedQ15);

/**
 * \brief Check and process clear fault requests
 *
 * Resets the clearFault request once it has been propagated to all underlying components and requests a clearFault
 * of FocSolution itself in case it is in fault state.
 *
 * Inputs and outputs of this API:
 *     [in] self->p_status.state
 *     [inout] self->p_clearFault
 *     [out] self->p_clearFaultIsRequested
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline void Ifx_MS_FocSolution_F16_checkAndProcessClearFault(Ifx_MS_FocSolution_F16* self);

/* Determine and return the ref. q current in the speed loop. If direct interface is enabled it sets it equal to the
 * direct interface Q ref. current and resets the speed PI with the input ref. Q current. Else it calls currentQRefCalc
 * to calculate the ref. q current based on the estimated speed and the rate limited speed. */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_currentQRef(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                  estimatedSpeedQ15, Ifx_Math_Fract16 currentQRef);

/* Calculate the ref. q current by determining the speed error with calcSpeedErrorQ14, getting the q voltage saturation
 * status from the FocController and passing both values on to the speed PI controller. If speed precontrol is enabled,
 * the output of the PI controller is passed on to calcSumCurrentQRef, which calculates the ref q. current. Else the ref
 * q. current is directly set to the output of the PI controller and the state of SpeedPreControl is reset with the last
 * ref. speed. */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_currentQRefCalc(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                      estimatedSpeedQ15);

/**
 * \brief Calculate the transition speed down, middle, and half the band
 *
 * This function calculates the transition speed down and middle transition speed. It also calculates half of the
 * transition speed band.
 *
 * \param self Reference to structure that contains instance data members
 */
static inline void Ifx_MS_FocSolution_F16_p_calcInternalTransitionSpeeds(Ifx_MS_FocSolution_F16* self);

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

/* Implement the check for the transition between open and closed loop. As long as the conditions are not fulfilled
 * either ramp down the Q current by calling decreaseQCurrent or set the dqCommand directly in case the direct interface
 * is enabled.
 * Conditions for the transition:
 *  - the angle error returned by private function angleError is smaller than the transition angle tolerance, OR
 *  - the maximum transition time has elapsed
 * Return true if at least one of the conditions is true, and additionally set the integral previous value of the speed
 * pi controller to the last reached ref. q current to improve the transient response in closed loop. */
static inline bool Ifx_MS_FocSolution_F16_angleMergeCheck(Ifx_MS_FocSolution_F16          * self,
                                                          Ifx_MDA_IToFController_F16_Output iToFOutput,
                                                          Ifx_Math_CmpFract16               currentsDqRef);

/* Calculate and return the angle error by subtracting the output of the Flux Estimator (estimated angle) from the
 * output of the IToF Controller (reference angle) and wrapping the result within -pi and pi */
static inline Ifx_Math_Fract32 Ifx_MS_FocSolution_F16_angleError(Ifx_MS_FocSolution_F16          * self,
                                                                 Ifx_MDA_IToFController_F16_Output iToFOutput);

/* Increase the amplitude of the reference Q current when transitioning/ramping down. This API calculates the difference
 * between the last ref. Q current and the IToF ref. Q current and uses the transition counter to calculate a slope to
 * set the Q current command to. In case of a positive rate limited speed, the Q current command ramps to the positive
 * IToF ref. Q current, and in case of a negative rate limited speed, the Q current command ramps to the
 * negative IToF ref. Q current. */
static inline void Ifx_MS_FocSolution_F16_increaseQCurrent(Ifx_MS_FocSolution_F16                * self,
                                                           Ifx_MDA_IToFController_F16_Output const iToFOutput,
                                                           Ifx_Math_Fract16 const
                                                           transitionCounterQ15);

/* Decrease the amplitude of the reference Q current when transitioning up. This API increments the transition counter,
 * calculates a slope based on the transition time and then decreases the amplitude of the imaginary ref. current by
 * that slope. In case of a positive rate limited speed the ramp starts at the positive IToF ref. Q current, and in case
 * of a negative rate limited speed at the negative IToF ref. Q current. */
static inline void Ifx_MS_FocSolution_F16_decreaseQCurrent(Ifx_MS_FocSolution_F16                * self,
                                                           Ifx_MDA_IToFController_F16_Output const iToFOutput);

/* Decrease the amplitude of the reference D current when transitioning/ramping down. It linearily decreases the actual
 * D current based on the transitionCounter, the input reference D current and the transition down target D current.
 * This function expects a positive reference D current as well as a positive transition down target D current. */
static inline void Ifx_MS_FocSolution_F16_decreaseDCurrent(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 const
                                                           currentDRefQ15, Ifx_Math_Fract16 const
                                                           transitionCounterQ15);
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */

/**
 * \brief Calculate internal variable p_transitionDeltaQ15
 *
 * This function calculates the internal variable p_transitionDeltaQ15 based on the transitionTimeLimit_cycles input,
 * as the ratio of IFX_MATH_FRACT16_MAX and transitionTimeLimit_cycles. If transitionTimeLimit_cycles is greater than
 * IFX_MATH_FRACT16_MAX, then p_transitionDeltaQ15 is set to 1.
 *
 * \param self Reference to structure that contains instance data members
 * \param transitionTimeLimit_cycles Time limit to do the transition, in number of execution cycles
 */
static inline void Ifx_MS_FocSolution_F16_p_setTransitionDelta(Ifx_MS_FocSolution_F16* self, uint16_t
                                                               transitionTimeLimit_cycles);

/**
 * \brief Set the transition down target D current
 *
 * This function calculates the internal parameter transitionDownTargetDCurrentQ15 as a multiplication of the
 * startup current and target D current scaling factor.
 *
 * \param self Reference to structure that contains instance data members
 */
static inline void Ifx_MS_FocSolution_F16_p_setTransitionDownTargetDCurrentQ15(Ifx_MS_FocSolution_F16* self);

