Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
/* API to initialize speed precontrol */
static inline void Ifx_MS_FocSolution_F16_initSpeedPreControl(Ifx_MS_FocSolution_F16* self);

/* Initialize reference current limiter */
static inline void Ifx_MS_FocSolution_F16_initRefCurrentLimiter(Ifx_MS_FocSolution_F16* self);

/* Calculate the sum of feedforward and feedback current by executing the Math speedPreControl component using the rate
 * limited speed as input, adding the result to the speedPiOut, limiting using the Math limit component and returning
 * the limited result */
static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_calcSumCurrentQRef(Ifx_MS_FocSolution_F16* self,
                                                                         Ifx_Math_Fract16        speedPiOut);

/* Check if all modules are in the off state */
static inline bool Ifx_MS_FocSolution_F16_checkModulesStateOff(Ifx_MS_FocSolution_F16* self);

/* API to initialize the iToF angle and to set the dq ref. currents, based on the ref. speed. The d current command is
 * directly set to the IToF reference d current, and the q current command is determined by calling setQCommand.
 * Additionally, update the previousQCommand variable. */
static inline void Ifx_MS_FocSolution_F16_setDqCommand(Ifx_MS_FocSolution_F16* self, Ifx_MDA_IToFController_F16_Output
                                                       iToFOutput);

/* API to set the q current command based on the rate limited speed. First executes the Math RateLimit component to
 * limit the rate of change of the q current command. Then it sets the q current command to the output of the RateLimit,
 * respectively to the negated output in case the rate limited speed is negative. Additionally, calls
 * detectQCommandZeroCross to check whether the Q command changed its sign. */
static inline void Ifx_MS_FocSolution_F16_setQCommand(Ifx_MS_FocSolution_F16* self, Ifx_MDA_IToFController_F16_Output
                                                      iToFOutput);

/* API to detect current Q command sign change */
static inline void Ifx_MS_FocSolution_F16_detectQCommandZeroCross(Ifx_MS_FocSolution_F16* self);

/* Rotates the DQ reference system by calling the IToFController API to add 180 degrees (Pi) to the I2F angle and by
 * resetting the current PIs with the negative of their previous value */
static inline void Ifx_MS_FocSolution_F16_rotateDQRefSystem(Ifx_MS_FocSolution_F16* self);

/******************************************************************************/
/*------------------------Private Variables/Constants-------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MS_FocSolution_F16_componentID = {
    .sourceID     = IFX_MS_FOCSOLUTION_F16_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MS_FOCSOLUTION_F16_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MS_FOCSOLUTION_F16_COMPONENTID_MODULEID,
    .componentID1 = IFX_MS_FOCSOLUTION_F16_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MS_FOCSOLUTION_F16_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MS_FocSolution_F16_componentVersion = {
    .major = IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_MAJOR,
    .minor = IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_MINOR,
    .patch = IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_PATCH,
    .t     = IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_T,
    .rev   = IFX_MS_FOCSOLUTION_F16_COMPONENTVERSION_REV
};

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/
/* temporary solution, XML_VERSION indicates if static cfg is generated by cfgwiz */
#ifdef IFX_MS_FOCSOLUTION_F16_CFG_XML_VERSION
/* Default parameters initialized with CfgWizard defines */
Ifx_MS_FocSolution_F16_Param Ifx_MS_FocSolution_F16_g_defaultParam =
{
    .transitionAngleTolerance          = (int32_t)IFX_MS_FOCSOLUTION_F16_CFG_ANGLE_ERROR_MIN,
    .speedRampUpRateOpenLoopQ30        = IFX_MS_FOCSOLUTION_F16_CFG_OPEN_LOOP_RAMP_UP_RATE_Q30,
    .speedRampDownRateOpenLoopQ30      = IFX_MS_FOCSOLUTION_F16_CFG_OPEN_LOOP_RAMP_DOWN_RATE_Q30,
    .speedRampUpRateClosedLoopQ30      = IFX_MS_FOCSOLUTION_F16_CFG_CLOSED_LOOP_RAMP_UP_RATE_Q30,
    .speedRampDownRateClosedLoopQ30    = IFX_MS_FOCSOLUTION_F16_CFG_CLOSED_LOOP_RAMP_DOWN_RATE_Q30,
    .transitionTimeLimit_cycles        = (uint16_t)IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_TIME_CYCLES,
    .startUpCurrentQ15                 = IFX_MS_FOCSOLUTION_F16_CFG_START_UP_CURRENT_Q15,
    .initStartupCurrentQ15             = IFX_MS_FOCSOLUTION_F16_CFG_INIT_START_UP_CURRENT_Q15,
    .transitionDownDCurrentScalingQ14  = IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_D_CURRENT_SCALING_Q14,
    .startUpCurrentRampUpRateQ15       = IFX_MS_FOCSOLUTION_F16_CFG_START_CURRENT_RAMP_UP_RATE_Q15,
    .qCurrentAtTransitionQ15           = IFX_MS_FOCSOLUTION_F16_CFG_Q_CURRENT_AT_TRANSITION_Q15,
    .minimumSpeedThresholdQ15          = IFX_MS_FOCSOLUTION_F16_CFG_MIN_SPEED_THRESHOLD_Q15,
    .transitionSpeedUpQ15              = IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_SPEED_UP_Q15,
    .transitionSpeedBandQ15            = IFX_MS_FOCSOLUTION_F16_CFG_SPEED_BAND_Q15,
    .refCurrentLowerLimitQ15           = IFX_MS_FOCSOLUTION_F16_CFG_SPEED_PI_OUT_LOW_LIMIT_Q,
    .refCurrentUpperLimitQ15           = IFX_MS_FOCSOLUTION_F16_CFG_SPEED_PI_OUT_UPP_LIMIT_Q,
    .speedPiPropGain                   = IFX_MS_FOCSOLUTION_F16_CFG_SPEED_PI_PROPGAIN_N_TU,
    .speedPiIntegGainSamplingTime      = IFX_MS_FOCSOLUTION_F16_CFG_SPEED_PI_KI_TS_N_TU,
    .speedPiAntiWindupGainSamplingTime = IFX_MS_FOCSOLUTION_F16_CFG_SPEED_PI_KAW_TS_N_TU,
    .frictionConstant                  = IFX_MS_FOCSOLUTION_F16_CFG_VISCOUS_FRICTION_CONSTANT_Q15,
    .rotorInertiaOverSamplingTime      = IFX_MS_FOCSOLUTION_F16_CFG_INERTIA_BY_TS_N_TU,
    .inverseTorqueConstant             = IFX_MS_FOCSOLUTION_F16_CFG_INVERSE_TORQUE_CONSTANT_Q15,
    .refSpeedUpperLimitQ15             = IFX_MS_FOCSOLUTION_F16_CFG_MAXIMUM_SPEED_Q15,
    .refSpeedLowerLimitQ15             = IFX_MS_FOCSOLUTION_F16_CFG_MINIMUM_SPEED_Q15,
};

Ifx_MS_FocSolution_F16_ParamComposition Ifx_MS_FocSolution_F16_g_defaultParamComposition =
{
    .fluxEstimatorParam  = &Ifx_MDA_FluxEstimator_F16_g_defaultParam,
    .focControllerParam  = &Ifx_MDA_FocController_F16_g_defaultParam,
    .iToFControllerParam = &Ifx_MDA_IToFController_F16_g_defaultParam,
    .modulatorParam      = &Ifx_MAS_Modulator_F16_g_defaultParam,
    .vToFControllerParam = &Ifx_MDA_VToFController_F16_g_defaultParam,
};
#endif
/* *INDENT-ON* */
/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/
/* Function to get the component ID */
void Ifx_MS_FocSolution_F16_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MS_FocSolution_F16_componentID;
}


