Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
/* Function to get the component version */
void Ifx_MS_FocSolution_F16_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MS_FocSolution_F16_componentVersion;
}


void Ifx_MS_FocSolution_F16_init(Ifx_MS_FocSolution_F16* self, Ifx_MS_FocSolution_F16_Param* param,
                                 Ifx_MS_FocSolution_F16_ParamComposition* paramComposition)
{
    self->param = param;

    /* Initialize modules from used libraries */
    Ifx_MS_FocSolution_F16_initModules(self, paramComposition);

    /* Initialize speed PI controller */
    Ifx_MS_FocSolution_F16_initSpeedPi(self);

    /* Initialize internal transition speed parameters */
    Ifx_MS_FocSolution_F16_p_calcInternalTransitionSpeeds(self);

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

    /* Init transition counter and limit */
    Ifx_MS_FocSolution_F16_p_setTransitionDelta(self, self->param->transitionTimeLimit_cycles);
    self->p_transitionCounter_cycles = 0u;

    /* Set the D current for smooth transition */
    Ifx_MS_FocSolution_F16_p_setTransitionDownTargetDCurrentQ15(self);

#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
    /* Initialize speed and acceleration limiters */
    Ifx_MS_FocSolution_F16_initSpeedAccelerationLimiters(self);

    /* Initialize startup current rate limiter */
    Ifx_MS_FocSolution_F16_initStartCurrentRateLimiter(self);

    /* Initialize internal variables */
    self->p_status.state          = Ifx_MS_FocSolution_F16_State_init;
    self->p_status.subState       = Ifx_MS_FocSolution_F16_SubState_openLoop;
    self->p_enablePowerStage      = false;
    self->p_enableControl         = false;
    self->p_clearFault            = false;
    self->p_clearFaultIsRequested = false;
    self->p_qCommandZeroCrossing  = false;
}


void Ifx_MS_FocSolution_F16_executeSpeedControl(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15,
                                                Ifx_Math_CmpFract16 currentsDqRef)
{
    Ifx_MS_FocSolution_F16_checkAndProcessClearFault(self);
    Ifx_MHA_DriverGroup_F16_executeBridgeDriver(&(self->driverGroup));
    Ifx_MS_FocSolution_F16_stateMachine(self, speedQ15, currentsDqRef);

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

    /* Disable start angle identification */
    self->p_enableStartAngleIdent = false;
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
}


static inline void Ifx_MS_FocSolution_F16_checkAndProcessClearFault(Ifx_MS_FocSolution_F16* self)
{
    if (self->p_clearFault == true)
    {
        /* Request to clear the faults of the underlying components  no matter whether FocSolution is in fault state or
         * not to make sure that the fault bits of the underlying components can be cleared */
        bool clearFaultPropagated = Ifx_MS_FocSolution_F16_clearModuleFaults(self);

        if (self->p_status.state == Ifx_MS_FocSolution_F16_State_fault)
        {
            /* Request to clear the fault state of FocSolution itself */
            self->p_clearFaultIsRequested = true;
        }

        /* polyspace +2 MISRA-C3:14.3 [Justified:Low] "False positive, the controlling expression is not invariant,
         * depending on the target platform MHA the if condition can be true or false." */
        if (clearFaultPropagated == true)
        {
            self->p_clearFault = false;
        }
    }
}


static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_currentQRef(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                  estimatedSpeedQ15, Ifx_Math_Fract16 currentQRef)
{
    Ifx_Math_Fract16 refCurrent;

    /* Check if the direct interface is enabled */
    if (self->p_enableDirectInterface == true)
    {
        /* Set the ref. Q current to the input ref. Q current */
        refCurrent = currentQRef;

        /* Reset speed PI if direct interface is enabled with the input ref. Q current */
        Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->speedPi), currentQRef);
    }
    else
    {
        refCurrent = Ifx_MS_FocSolution_F16_currentQRefCalc(self, estimatedSpeedQ15);
    }

    return refCurrent;
}


static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_currentQRefCalc(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                      estimatedSpeedQ15)
{
    Ifx_Math_Fract16               refCurrent;
    Ifx_Math_Fract16               errSpeedQ14     = Ifx_MS_FocSolution_F16_calcSpeedErrorQ14(
        self->rateLimitInSpeedQ15, estimatedSpeedQ15);
    Ifx_Math_Pi_F16_AntiWindupCtrl qAntiwindupCtrl = Ifx_MDA_FocController_F16_getQVoltageSatStatus(
        &(self->focController));

    /* Execute speed PI */
    Ifx_Math_Fract16               speedPiOut = Ifx_Math_Pi_F16_execute(&(self->speedPi), errSpeedQ14,
        qAntiwindupCtrl);

    /* Check if speedPreControl is enabled */
    if (self->p_enableSpeedPreControl == true)
    {
        /* Calculate sum of feedforward and feedback current and limit result */
        refCurrent = Ifx_MS_FocSolution_F16_calcSumCurrentQRef(self, speedPiOut);
    }
    else
    {
        /* Reset state of SpeedPreControl with the last ref. speed */
        Ifx_Math_SpeedPreControl_F16_setPreviousSpeed(&(self->speedPreControl), self->rateLimitInSpeedQ15);

        /* Set the ref. current to the output of the speed PI */
        refCurrent = speedPiOut;
    }

    return refCurrent;
}


static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_calcSpeedErrorQ14(Ifx_Math_Fract16 rateLimitInSpeedQ15,
                                                                        Ifx_Math_Fract16 estimatedSpeedQ15)
{
    Ifx_Math_Fract16 rateLimitInSpeedQ14 = Ifx_Math_ShR_F16(rateLimitInSpeedQ15, 1U);
    Ifx_Math_Fract16 estimatedSpeedQ14   = Ifx_Math_ShR_F16(estimatedSpeedQ15, 1U);
    Ifx_Math_Fract16 errSpeedQ14         = Ifx_Math_Sub_F16(rateLimitInSpeedQ14, estimatedSpeedQ14);

