Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
    return errSpeedQ14;
}


static inline Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_calcSumCurrentQRef(Ifx_MS_FocSolution_F16* self,
                                                                         Ifx_Math_Fract16        speedPiOut)
{
    /* Execute speed precontrol */
    Ifx_Math_Fract16 speedPreControlOut = Ifx_Math_SpeedPreControl_F16_execute(&(self->speedPreControl),
        self->rateLimitInSpeedQ15);

    /* Sum the two reference currents from speed control and speed precontrol */
    Ifx_Math_Fract16 refCurrentSum = Ifx_Math_AddSat_F16(speedPiOut, speedPreControlOut);

    /* Limit the sum of the two reference currents */
    Ifx_Math_Fract16 refCurrentSumLimited = Ifx_Math_Limit_F16_execute(&(self->p_refCurrentLimit), refCurrentSum);

    return refCurrentSumLimited;
}


/* API to execute the fast loop operations */
void Ifx_MS_FocSolution_F16_executeControlMode(Ifx_MS_FocSolution_F16* self)
{
    /* Local variables */
    Ifx_Math_PolarFract16          voltageCommandPolar;
    Ifx_MHA_DriverGroup_F16_Output driverGroupOutput;
    uint32_t                       estimatedAngle;

    /* Return voltage measurement and perform current measurement and reconstruction */
    driverGroupOutput = Ifx_MS_FocSolution_F16_measureAndReconstruct(self);

    /* Perform the angle and speed estimation */
    estimatedAngle = Ifx_MS_FocSolution_F16_fluxEstimation(self);

    if ((self->p_status.state == Ifx_MS_FocSolution_F16_State_run)
        || (self->p_status.state == Ifx_MS_FocSolution_F16_State_rampDown))
    {
        if (self->p_status.actualControlMode == Ifx_MS_FocSolution_F16_ControlMode_foc)
        {
            voltageCommandPolar = Ifx_MS_FocSolution_F16_regulationLoop(self, estimatedAngle,
                driverGroupOutput.dcLinkVoltageQ15);
        }

        /* p_status.actualControlMode == Ifx_MS_FocSolution_F16_ControlMode_vToF */
        else
        {
            voltageCommandPolar = Ifx_MS_FocSolution_F16_vToFLoop(self);
        }
    }
    else
    {
#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

        /* Execute start angle identification */
        /* Ensure to call this function in all states, as otherwise clearfault will not be handled */
        Ifx_MDA_StartAngleIdent_F16_execute(&(self->startAngleIdent), driverGroupOutput.dcLinkVoltageQ15,
            driverGroupOutput.shuntCurrentsQ15);
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
        /* Modulator output is 0 while in standby, fault, off, startAngleIdent, init */
        voltageCommandPolar.amplitude = 0;
        voltageCommandPolar.angle     = 0;
    }

    /* Generate voltage according to the command */
    Ifx_MS_FocSolution_F16_voltageGeneration(self, voltageCommandPolar, driverGroupOutput);
}


static inline void Ifx_MS_FocSolution_F16_rotateDQRefSystem(Ifx_MS_FocSolution_F16* self)
{
    /* Add 180deg. to the I2f angle */
    Ifx_MDA_IToFController_F16_addOneEightyDegreeInAngle(&(self->iToF));

    /* Get current controllers previous value */
    Ifx_Math_Fract16 currentDPiPrevValue = Ifx_Math_Pi_F16_getIntegPreviousValue(&(self->focController.currentDPi));
    Ifx_Math_Fract16 currentQPiPrevValue = Ifx_Math_Pi_F16_getIntegPreviousValue(&(self->focController.currentQPi));

    /* Reset current PIs with negative of previous value */
    Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->focController.currentDPi), Ifx_Math_NegSat_F16(
        currentDPiPrevValue));
    Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->focController.currentQPi), Ifx_Math_NegSat_F16(
        currentQPiPrevValue));
}


static inline bool Ifx_MS_FocSolution_F16_clearModuleFaults(Ifx_MS_FocSolution_F16* self)
{
    /* Flag whether the clear fault request has been propagated to all underlying modules */
    bool clearFaultPropagated;

    /* Clear faults of MHA modules */
    clearFaultPropagated = Ifx_MS_FocSolution_F16_clearModuleFaultsMHA(self);

    /* Clear faults of MAS modules */
    Ifx_MS_FocSolution_F16_clearModuleFaultsMAS(self);

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

    /* Clear faults of MDA modules */
    Ifx_MS_FocSolution_F16_clearModuleFaultsMDA(self);
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */

    return clearFaultPropagated;
}


static inline bool Ifx_MS_FocSolution_F16_clearModuleFaultsMHA(Ifx_MS_FocSolution_F16* self)
{
    /* Flag whether the clear fault request has been propagated to all underlying modules */
    bool clearFaultPropagated = false;

    /* Clear faults of modules */
    clearFaultPropagated = Ifx_MHA_DriverGroup_F16_clearFaults(&self->driverGroup);

    return clearFaultPropagated;
}


static inline void Ifx_MS_FocSolution_F16_clearModuleFaultsMAS(Ifx_MS_FocSolution_F16* self)
{
    /* Variable declaration */
    Ifx_MAS_Modulator_F16_Status modulatorStatus;

    /* Get the status of modules */
    modulatorStatus = Ifx_MAS_Modulator_F16_getStatus(&self->modulator);

    /* Clear faults of modules */
    if ((modulatorStatus.maxAmplitudeFlag != false)
        || (modulatorStatus.overmodulationFlag != false))
    {
        Ifx_MAS_Modulator_F16_clearFault(&self->modulator);
    }
}


#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
static inline void Ifx_MS_FocSolution_F16_clearModuleFaultsMDA(Ifx_MS_FocSolution_F16* self)
{
    /* Variable declaration */
    Ifx_MDA_StartAngleIdent_F16_Status startAngleIdentStatus;

    /* Get the status of modules */
    startAngleIdentStatus = Ifx_MDA_StartAngleIdent_F16_getStatus(&self->startAngleIdent);

    /* Clear faults of modules */
    if (startAngleIdentStatus.voltageFluctuation != false)
    {
        Ifx_MDA_StartAngleIdent_F16_clearFault(&(self->startAngleIdent));
    }
}


#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
static inline Ifx_MHA_DriverGroup_F16_Output Ifx_MS_FocSolution_F16_measureAndReconstruct(
    Ifx_MS_FocSolution_F16* self)
{
    /* Get measured shunt currents from previous cycle */
    Ifx_MHA_DriverGroup_F16_Output driverGroupOutput;
    Ifx_MHA_DriverGroup_F16_measureAndReconstruct(&(self->driverGroup), self->previousCurrentReconstructionInfo);
    Ifx_MHA_DriverGroup_F16_getOutput(&(self->driverGroup), &driverGroupOutput);

