Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
    /* Update current reconstruction information for the next state */
    self->previousCurrentReconstructionInfo = self->p_currentReconstructionInfo;

    /* Current Clark transformation (UVW to alpha-beta) */
    self->currentsAlphaBeta = Ifx_Math_Clarke_F16(driverGroupOutput.currentsUVW);

    return driverGroupOutput;
}


static inline uint32_t Ifx_MS_FocSolution_F16_fluxEstimation(Ifx_MS_FocSolution_F16* self)
{
    /* Flux estimator */
    Ifx_MDA_FluxEstimator_F16_execute(&(self->fluxEstimator), self->previousVoltageAlphaBeta,
        self->currentsAlphaBeta);

    /* Store voltage for next cycle */
    self->previousVoltageAlphaBeta = self->voltageAlphaBeta;

    /* Assign estimated speed output */
    Ifx_MDA_FluxEstimator_F16_Output fluxEstimatorOutput;
    Ifx_MDA_FluxEstimator_F16_getOutput(&(self->fluxEstimator), &fluxEstimatorOutput);
    self->p_output.estimatedSpeedQ15 = fluxEstimatorOutput.speedQ15;

    /* Return estimated angle */
    return fluxEstimatorOutput.anglePLL;
}


/* Execute the fast loop operations with IToF and FOC */
static inline Ifx_Math_PolarFract16 Ifx_MS_FocSolution_F16_regulationLoop(Ifx_MS_FocSolution_F16* self, uint32_t
                                                                          estimatedAngle, Ifx_Math_Fract16
                                                                          dcLinkVoltageQ15)
{
    /* Check if the Q command changes sign */
    if (self->p_qCommandZeroCrossing == true)
    {
        /* Rotate ref. DQ system if Q command changes sign */
        Ifx_MS_FocSolution_F16_rotateDQRefSystem(self);

        /* Set the current zero cross flag to false */
        self->p_qCommandZeroCrossing = false;
    }

    if (self->p_status.subState == Ifx_MS_FocSolution_F16_SubState_closedLoop)
    {
        /* Set the angle for Park transformation from FE */
        Ifx_MS_FocSolution_F16_closedLoop(self, estimatedAngle);
    }
    else
    {
        /* Execute iToF and set the angle for Park transformation from iToF */
        Ifx_MS_FocSolution_F16_openLoop(self);
    }

    /* Field Oriented Controller */
    Ifx_MDA_FocController_F16_execute(&(self->focController), self->currentsAlphaBeta, self->dqCommand, self->angle,
        self->rateLimitInSpeedQ15, dcLinkVoltageQ15);
    Ifx_MDA_FocController_F16_Output focControllerOutput;
    Ifx_MDA_FocController_F16_getOutput(&(self->focController), &focControllerOutput);

    return focControllerOutput.voltageCommandPolar;
}


/* Open loop implementation */
static inline void Ifx_MS_FocSolution_F16_openLoop(Ifx_MS_FocSolution_F16* self)
{
    /* Execute IToF block to generate the angle */
    Ifx_MDA_IToFController_F16_execute(&(self->iToF), self->rateLimitInSpeedQ15);
    Ifx_MDA_IToFController_F16_Output iToFOutput;
    Ifx_MDA_IToFController_F16_getOutput(&(self->iToF), &iToFOutput);

    /* Angle is set by IToF */
    self->angle = iToFOutput.currentVecAngle_rad;
}


/* Closed loop implementation */
static inline void Ifx_MS_FocSolution_F16_closedLoop(Ifx_MS_FocSolution_F16* self, uint32_t fluxEstimatorAngle)
{
    /* Get the angle from the flux estimator */
    self->angle = fluxEstimatorAngle;
}


/* Execute the fast loop operations with VToF */
static inline Ifx_Math_PolarFract16 Ifx_MS_FocSolution_F16_vToFLoop(Ifx_MS_FocSolution_F16* self)
{
    Ifx_MDA_VToFController_F16_Output vToFControllerOutput;
    Ifx_MDA_VToFController_F16_execute(&(self->vToF), self->rateLimitInSpeedQ15);
    Ifx_MDA_VToFController_F16_getOutput(&(self->vToF), &vToFControllerOutput);

    return vToFControllerOutput.voltageVector;
}


static inline void Ifx_MS_FocSolution_F16_voltageGeneration(Ifx_MS_FocSolution_F16* self, Ifx_Math_PolarFract16
                                                            voltageCommandPolar, Ifx_MHA_DriverGroup_F16_Output
                                                            driverGroupOutput)
{
    /* Private variable to store the modulator output */
    Ifx_MAS_Modulator_F16_Output modulatorOutput;

    /* Private variables to store compare values and trigger times */
    uint16_t                   * compareValues_tick;
    uint16_t                   * triggerTime_tick;

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

    /* Private variable to store the start angle identification output */
    Ifx_MDA_StartAngleIdent_F16_Output startAngleIdentOutput;

    /* Call pattern generator with compare values depending on the state */
    if (self->p_status.state != Ifx_MS_FocSolution_F16_State_startAngleIdent)
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
    {
        /* Call modulator */
        /* Ensure to call this function in all states, as otherwise clearfault will not be handled */
        Ifx_MAS_Modulator_F16_execute(&(self->modulator), voltageCommandPolar, driverGroupOutput.dcLinkVoltageQ15);
        Ifx_MAS_Modulator_F16_getOutput(&(self->modulator), &modulatorOutput);

        /* Store current reconstruction information */
        self->p_currentReconstructionInfo = modulatorOutput.currentReconstructionInfo;

        /* Convert actual voltage from modulator to cartesian, to be used by the flux estimator */
        self->voltageAlphaBeta = Ifx_Math_PolarToCart_F16(modulatorOutput.actualVoltage);

        /* Assign compare values and triggers */
        compareValues_tick = modulatorOutput.compareValues_tick;
        triggerTime_tick   = modulatorOutput.triggerTime_tick;
    }

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
    else
    {
        /* Get start angle identification output */
        Ifx_MDA_StartAngleIdent_F16_getOutput(&(self->startAngleIdent), &startAngleIdentOutput);

        /* Assign compare values and triggers */
        compareValues_tick = startAngleIdentOutput.compareValues_tick;
        triggerTime_tick   = startAngleIdentOutput.triggerTime_tick;
    }
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
    /* Call pattern generator */
    /* Ensure to call this function in all states, as otherwise clearfault will not be handled */
    Ifx_MHA_DriverGroup_F16_setCompVal(&(self->driverGroup), compareValues_tick, triggerTime_tick);
}


/* Init all modules */
void Ifx_MS_FocSolution_F16_initModules(Ifx_MS_FocSolution_F16                 * self,
                                        Ifx_MS_FocSolution_F16_ParamComposition* paramComposition)
{
    /* Initialize hardware abstraction modules */
    Ifx_MHA_DriverGroup_F16_initModules(&(self->driverGroup));

    /* Initialize building blocks and drive algorithm modules */
    Ifx_MAS_Modulator_F16_init(&(self->modulator), paramComposition->modulatorParam);
    Ifx_MS_FocSolution_F16_initDriveAlgo(self, paramComposition);

