Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
    /* Init speed precontrol */
    Ifx_MS_FocSolution_F16_initSpeedPreControl(self);

    /* Init reference current limiter */
    Ifx_MS_FocSolution_F16_initRefCurrentLimiter(self);
}


static inline void Ifx_MS_FocSolution_F16_initSpeedPreControl(Ifx_MS_FocSolution_F16* self)
{
    /*Static configuration */
    Ifx_Math_SpeedPreControl_F16_StaticConfig speedPreControlStaticConfig;

    /* Friction constant */
    speedPreControlStaticConfig.fricitionConstant = self->param->frictionConstant;

    /* Get the gain J/Ts in Q format */
    speedPreControlStaticConfig.rotorInertiaOverSamplingTime = Ifx_Math_ConvToQForm_F16(
        self->param->rotorInertiaOverSamplingTime, IFX_MS_FOCSOLUTION_F16_DEC_PLACES);

    /* Call init */
    Ifx_Math_SpeedPreControl_F16_init(&(self->speedPreControl), speedPreControlStaticConfig);

    /* set Inverse torque ct. */
    Ifx_Math_SpeedPreControl_F16_setInverseTorqueConstant(&(self->speedPreControl),
        self->param->inverseTorqueConstant);
}


static inline void Ifx_MS_FocSolution_F16_initRefCurrentLimiter(Ifx_MS_FocSolution_F16* self)
{
    /* Set upper limit of reference current limiter */
    Ifx_Math_Limit_F16_setUpperLimit(&(self->p_refCurrentLimit), self->param->refCurrentUpperLimitQ15);

    /* Set lower limit of reference current limiter */
    Ifx_Math_Limit_F16_setLowerLimit(&(self->p_refCurrentLimit), self->param->refCurrentLowerLimitQ15);
}


void Ifx_MS_FocSolution_F16_setRefSpeedLowerLimit(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                  refSpeedLowerLimitQ15)
{
    /* Set internal parameter */
    self->param->refSpeedLowerLimitQ15 = refSpeedLowerLimitQ15;

    /* Set lower limit of reference speed limiter */
    Ifx_Math_Limit_F16_setLowerLimit(&(self->speedLimit), self->param->refSpeedLowerLimitQ15);
}


void Ifx_MS_FocSolution_F16_setRefSpeedUpperLimit(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                  refSpeedUpperLimitQ15)
{
    /* Set internal parameter */
    self->param->refSpeedUpperLimitQ15 = refSpeedUpperLimitQ15;

    /* Set upper limit of reference speed limiter */
    Ifx_Math_Limit_F16_setUpperLimit(&(self->speedLimit), self->param->refSpeedUpperLimitQ15);
}


Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getRefSpeedUpperLimit(Ifx_MS_FocSolution_F16* self)
{
    return self->param->refSpeedUpperLimitQ15;
}


Ifx_Math_Fract16 Ifx_MS_FocSolution_F16_getRefSpeedLowerLimit(Ifx_MS_FocSolution_F16* self)
{
    return self->param->refSpeedLowerLimitQ15;
}


static inline void Ifx_MS_FocSolution_F16_initDriveAlgo(Ifx_MS_FocSolution_F16                 * self,
                                                        Ifx_MS_FocSolution_F16_ParamComposition* paramComposition)
{
    /* Init FluxEstimator */
    Ifx_MDA_FluxEstimator_F16_init(&(self->fluxEstimator), paramComposition->fluxEstimatorParam);

    /* Init IToFController */
    Ifx_MDA_IToFController_F16_init(&(self->iToF), paramComposition->iToFControllerParam);

    /* Set IToFController parameters */
    Ifx_MDA_IToFController_F16_setReferenceCurrentImag(&(self->iToF), self->param->startUpCurrentQ15);

    /* Init FocController */
    Ifx_MDA_FocController_F16_init(&(self->focController), paramComposition->focControllerParam);

    /* Init VToFController */
    Ifx_MDA_VToFController_F16_init(&(self->vToF), paramComposition->vToFControllerParam);

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
    Ifx_MDA_StartAngleIdent_F16_init(&(self->startAngleIdent));
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
}


static inline void Ifx_MS_FocSolution_F16_initSpeedAccelerationLimiters(Ifx_MS_FocSolution_F16* self)
{
    /* Speed limiter */
    Ifx_Math_Limit_F16_setLowerLimit(&(self->speedLimit), self->param->refSpeedLowerLimitQ15);
    Ifx_Math_Limit_F16_setUpperLimit(&(self->speedLimit), self->param->refSpeedUpperLimitQ15);

    /* Acceleration limiter */
    Ifx_Math_AccelLimit_F16_init(&(self->accelerationLimit));
    Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&(self->accelerationLimit), self->param->speedRampUpRateOpenLoopQ30);
    Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&(self->accelerationLimit),
        self->param->speedRampDownRateOpenLoopQ30);
}


static inline void Ifx_MS_FocSolution_F16_initStartCurrentRateLimiter(Ifx_MS_FocSolution_F16* self)
{
    /* Initialize rate limiter */
    Ifx_Math_RateLimit_F16_init(&(self->p_startCurrentRateLimit));

    /* Set rate limiter up rate */
    Ifx_Math_RateLimit_F16_setUpRate(&(self->p_startCurrentRateLimit), self->param->startUpCurrentRampUpRateQ15);

    /* Set rate limiter down rate */
    Ifx_Math_RateLimit_F16_setDownRate(&(self->p_startCurrentRateLimit), self->param->startUpCurrentRampUpRateQ15);
}


static inline void Ifx_MS_FocSolution_F16_initSpeedPi(Ifx_MS_FocSolution_F16* self)
{
    /* Get the gain in Q format */
    Ifx_Math_Fract16Q        propGain                          = Ifx_Math_ConvToQForm_F16(
        self->param->speedPiPropGain, IFX_MS_FOCSOLUTION_F16_DEC_PLACES);
    Ifx_Math_Fract16Q        integGainSamplingTime             = Ifx_Math_ConvToQForm_F16(
        self->param->speedPiIntegGainSamplingTime, IFX_MS_FOCSOLUTION_F16_DEC_PLACES);
    Ifx_Math_Fract16Q        speedPiAntiWindupGainSamplingTime = Ifx_Math_ConvToQForm_F16(
        self->param->speedPiAntiWindupGainSamplingTime, IFX_MS_FOCSOLUTION_F16_DEC_PLACES);

    /* Set Q formats */
    Ifx_Math_Pi_F16_Qformats piCtrlSpeedQform = {
        .qFormatError = Ifx_Math_FractQFormat_q14, .qFormatOutput = Ifx_Math_FractQFormat_q15
    };

    /* Call init */
    Ifx_Math_Pi_F16_init(&(self->speedPi), piCtrlSpeedQform);

    /* Call setters */
    Ifx_Math_Pi_F16_setPropGain(&(self->speedPi), propGain);
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(&(self->speedPi), integGainSamplingTime);
    Ifx_Math_Pi_F16_setAntiWindupGainSamplingTime(&(self->speedPi), speedPiAntiWindupGainSamplingTime);
    Ifx_Math_Pi_F16_setUpperLimit(&(self->speedPi), self->param->refCurrentUpperLimitQ15);
    Ifx_Math_Pi_F16_setLowerLimit(&(self->speedPi), self->param->refCurrentLowerLimitQ15);
}


static void Ifx_MS_FocSolution_F16_localEnable(Ifx_MS_FocSolution_F16* self, bool enable)
{
    /* Enable/disable driverGroup */
    Ifx_MHA_DriverGroup_F16_enableModules(&(self->driverGroup), enable);

    /* Enable/disable modulator */
    Ifx_MAS_Modulator_F16_enable(&(self->modulator), enable);
}


