Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
static inline bool Ifx_MS_FocSolution_F16_checkModulesStateOn(Ifx_MS_FocSolution_F16* self)
{
    /* Variable declaration */
    Ifx_MAS_Modulator_F16_Status modulatorStatus;
    bool                         returnValue;

    /* Get the status of modulator */
    modulatorStatus = Ifx_MAS_Modulator_F16_getStatus(&self->modulator);

    /* Check if all modules are in the on state */
    if (Ifx_MHA_DriverGroup_F16_checkStateOn(&(self->driverGroup))
        && (modulatorStatus.state == Ifx_MAS_Modulator_F16_State_on))
    {
        returnValue = true;
    }
    else
    {
        returnValue = false;
    }

    return returnValue;
}


static inline bool Ifx_MS_FocSolution_F16_checkModulesStateOff(Ifx_MS_FocSolution_F16* self)
{
    /* Variable declaration */
    Ifx_MAS_Modulator_F16_Status modulatorStatus;
    bool                         returnValue;

    /* Get the status of modulator */
    modulatorStatus = Ifx_MAS_Modulator_F16_getStatus(&self->modulator);

    /* Check if all modules are in the off state */
    if (Ifx_MHA_DriverGroup_F16_checkStateOff(&(self->driverGroup))
        && (modulatorStatus.state == Ifx_MAS_Modulator_F16_State_off))
    {
        returnValue = true;
    }
    else
    {
        returnValue = false;
    }

    return returnValue;
}


/* API to set the fault status of the all used modules */
/* fault check for all the modules */
static bool Ifx_MS_FocSolution_F16_faultStatus(Ifx_MS_FocSolution_F16* self)
{
    /* local variable to check fault status */
    bool faultStatusRet = false;

    /* DriverGroup faults */
    faultStatusRet = Ifx_MHA_DriverGroup_F16_checkFaults(&(self->driverGroup));

    /* Modulator fault */
    if (Ifx_MAS_Modulator_F16_getStatus(&(self->modulator)).state == Ifx_MAS_Modulator_F16_State_fault)
    {
        faultStatusRet = true;
    }

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

    /* Start angle identification fault */
    else if (Ifx_MDA_StartAngleIdent_F16_getStatus(&(self->startAngleIdent)).state ==
             Ifx_MDA_StartAngleIdent_F16_State_fault)
    {
        faultStatusRet = true;
    }
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
    else
    {
        /* No operation */
    }

    /* Return the fault status */
    return faultStatusRet;
}


/* FOC state machine */
static inline void Ifx_MS_FocSolution_F16_stateMachine(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15,
                                                       Ifx_Math_CmpFract16 currentsDqRef)
{
    /* Variable to store the state */
    Ifx_MS_FocSolution_F16_State previousState = self->p_status.state;
    Ifx_MS_FocSolution_F16_State nextState;
    bool                         faultStatus   = Ifx_MS_FocSolution_F16_faultStatus(self);

    switch (previousState)
    {
        /* Initialize the module */
        case Ifx_MS_FocSolution_F16_State_init:
            nextState = Ifx_MS_FocSolution_F16_stateInit(self);
            break;

        /* All the modules are enabled */
        case Ifx_MS_FocSolution_F16_State_standBy:
            nextState = Ifx_MS_FocSolution_F16_stateStandby(self, faultStatus);
            break;

        /* Run state */
        case Ifx_MS_FocSolution_F16_State_run:
            nextState = Ifx_MS_FocSolution_F16_stateRun(self, speedQ15, faultStatus, currentsDqRef);
            break;

        /* FOC not running */
        case Ifx_MS_FocSolution_F16_State_off:
            nextState = Ifx_MS_FocSolution_F16_stateOff(self, faultStatus);
            break;

        /* FOC is in fault */
        case Ifx_MS_FocSolution_F16_State_fault:
            nextState = Ifx_MS_FocSolution_F16_stateFault(self);
            break;

        /* FOC is in ramp down state */
        case Ifx_MS_FocSolution_F16_State_rampDown:
            nextState = Ifx_MS_FocSolution_F16_stateRampDown(self, faultStatus, currentsDqRef);
            break;

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

        /*  FOC is in start angle identification state */
        case Ifx_MS_FocSolution_F16_State_startAngleIdent:
            nextState = Ifx_MS_FocSolution_F16_stateStartAngleIdent(self, speedQ15, faultStatus);
            break;

#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
        /* do default transition to INIT */
        default:
            nextState = Ifx_MS_FocSolution_F16_State_init;
            break;
    }

    self->p_status.state = nextState;
}


static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateInit(Ifx_MS_FocSolution_F16* self)
{
    Ifx_MS_FocSolution_F16_State nextState;

    /* Check if all the modules are in OFF state */
    if (Ifx_MS_FocSolution_F16_checkModulesStateOff(self) == true)
    {
        /* Set the state to OFF */
        nextState = Ifx_MS_FocSolution_F16_State_off;
    }
    else
    {
        nextState = Ifx_MS_FocSolution_F16_State_init;
    }

    return nextState;
}


static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateOff(Ifx_MS_FocSolution_F16* self, bool
                                                                           faultStatus)
{
    Ifx_MS_FocSolution_F16_State nextState;

    /* Reset previous values */
    Ifx_MS_FocSolution_F16_reset(self);

    if (faultStatus == true)
    {
        nextState = Ifx_MS_FocSolution_F16_State_fault;
    }

    /* Check if power stage is enabled */
    else if (self->p_enablePowerStage == true)
    {
        /* Enable underlying modules */
        Ifx_MS_FocSolution_F16_localEnable(self, true);

        /* Check if underlying modules are in the on state */
        if (Ifx_MS_FocSolution_F16_checkModulesStateOn(self) == true)
        {
            nextState = Ifx_MS_FocSolution_F16_State_standBy;
        }
        else
        {
            nextState = Ifx_MS_FocSolution_F16_State_off;
        }
    }
    else
    {
        nextState = Ifx_MS_FocSolution_F16_State_off;
    }

    return nextState;
}


static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStandby(Ifx_MS_FocSolution_F16* self, bool
                                                                               faultStatus)
{
    Ifx_MS_FocSolution_F16_State nextState;

    if (faultStatus == true)
    {
        /* Go into fault state */
        nextState = Ifx_MS_FocSolution_F16_State_fault;
    }
    else if (self->p_enablePowerStage == false)
    {
        nextState = Ifx_MS_FocSolution_F16_stateStandbyToOff(self);
    }

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
    else if (self->p_enableStartAngleIdent == true)
    {
        /* Enable start angle identification module */
        Ifx_MDA_StartAngleIdent_F16_enable(&(self->startAngleIdent), true);

        /* Go to start angle identification state */
        nextState = Ifx_MS_FocSolution_F16_State_startAngleIdent;
    }
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
    else if (self->p_enableControl == true)
    {
        nextState = Ifx_MS_FocSolution_F16_stateStandbyToRun(self);
    }
    else
    {
        nextState = Ifx_MS_FocSolution_F16_State_standBy;
    }

    /* Always reset FocCtrl module in standby */
    Ifx_MS_FocSolution_F16_reset(self);

    return nextState;
}


