Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStandbyToOff(Ifx_MS_FocSolution_F16* self)
{
    Ifx_MS_FocSolution_F16_State nextState;

    /* Disable all underlying modules */
    Ifx_MS_FocSolution_F16_localEnable(self, false);

    /* Check if underlying modules are in the off state */
    if (Ifx_MS_FocSolution_F16_checkModulesStateOff(self) == true)
    {
        nextState = Ifx_MS_FocSolution_F16_State_off;
    }
    else
    {
        nextState = Ifx_MS_FocSolution_F16_State_standBy;
    }

    return nextState;
}


static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStandbyToRun(Ifx_MS_FocSolution_F16* self)
{
    Ifx_MS_FocSolution_F16_State nextState;

    /* Update control mode */
    self->p_status.actualControlMode = Ifx_MS_FocSolution_F16_getControlMode(self);

    /* Set open loop ramp up/down rates */
    Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&(self->accelerationLimit), self->param->speedRampUpRateOpenLoopQ30);
    Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&(self->accelerationLimit),
        self->param->speedRampDownRateOpenLoopQ30);

    /* Init. substate machine */
    self->p_status.subState = Ifx_MS_FocSolution_F16_SubState_openLoop;

    /* Enable flux estimator */
    Ifx_MDA_FluxEstimator_F16_configMode(&(self->fluxEstimator), Ifx_MDA_FluxEstimator_F16_Mode_enable);

    /* Go to run state */
    nextState = Ifx_MS_FocSolution_F16_State_run;

    return nextState;
}


static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateRun(Ifx_MS_FocSolution_F16* self,
                                                                           Ifx_Math_Fract16 speedQ15, bool
                                                                           faultStatus, Ifx_Math_CmpFract16
                                                                           currentsDqRef)
{
    Ifx_MS_FocSolution_F16_State nextState;

    /* Perform speed and acceleration limit */
    Ifx_MS_FocSolution_F16_limitSpeed(self, speedQ15);

    if (faultStatus == true)
    {
        /* Disable flux estimator */
        Ifx_MDA_FluxEstimator_F16_configMode(&(self->fluxEstimator), Ifx_MDA_FluxEstimator_F16_Mode_disable);

        /* Set the module to fault */
        nextState = Ifx_MS_FocSolution_F16_State_fault;
    }
    else if ((self->p_enableControl == false)
             || (self->p_enablePowerStage == false))
    {
#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

        /* Reset transition counter */
        self->p_transitionCounter_cycles = 0U;
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
        /* Set state to ramp down */
        nextState = Ifx_MS_FocSolution_F16_State_rampDown;
    }
    else
    {
        /* Execute sub-state machine */
        Ifx_MS_FocSolution_F16_subStateMachine(self, currentsDqRef);

        /* Stay in run */
        nextState = Ifx_MS_FocSolution_F16_State_run;
    }

    return nextState;
}


static inline void Ifx_MS_FocSolution_F16_limitSpeed(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15)
{
    /* Value limited speed */
    Ifx_Math_Fract16 limSpeed;

    /* Limit input speed */
    limSpeed = Ifx_Math_Limit_F16_execute(&(self->speedLimit), speedQ15);

    /* Limit acceleration */
    self->rateLimitInSpeedQ15 = Ifx_Math_AccelLimit_F16_execute(&(self->accelerationLimit), limSpeed);
}


static inline void Ifx_MS_FocSolution_F16_subStateMachine(Ifx_MS_FocSolution_F16* self, Ifx_Math_CmpFract16
                                                          currentsDqRef)
{
    /* Variable to store the state */
    Ifx_MS_FocSolution_F16_SubState   previousSubState = self->p_status.subState;
    Ifx_MS_FocSolution_F16_SubState   nextSubState;
    Ifx_MDA_IToFController_F16_Output iToFOutput;
    Ifx_MDA_IToFController_F16_getOutput(&(self->iToF), &iToFOutput);

    switch (previousSubState)
    {
        /* Sub state machine run is in open loop */
        case Ifx_MS_FocSolution_F16_SubState_openLoop:
            nextSubState = Ifx_MS_FocSolution_F16_subStateOpenLoop(self, iToFOutput, currentsDqRef);
            break;

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

        /* Sub state machine run is in transition up */
        case Ifx_MS_FocSolution_F16_SubState_transitionUp:
            nextSubState = Ifx_MS_FocSolution_F16_subStateTransitUp(self, iToFOutput, currentsDqRef);
            break;

#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
        /* Sub state machine run is in closed loop */
        case Ifx_MS_FocSolution_F16_SubState_closedLoop:
            nextSubState = Ifx_MS_FocSolution_F16_subStateClosedLoop(self, currentsDqRef);
            break;

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

        /* Sub state machine run is in transition down */
        case Ifx_MS_FocSolution_F16_SubState_transitionDown:
            nextSubState = Ifx_MS_FocSolution_F16_subStateTransitDown(self, iToFOutput, currentsDqRef);
            break;

#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
        /* do default transition to open loop */
        default:
            nextSubState = Ifx_MS_FocSolution_F16_SubState_openLoop;
            break;
    }

    self->p_status.subState = nextSubState;
}


static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateOpenLoop(Ifx_MS_FocSolution_F16* self,
                                                                                      Ifx_MDA_IToFController_F16_Output
                                                                                      iToFOutput, Ifx_Math_CmpFract16
                                                                                      currentsDqRef)
{
    Ifx_MS_FocSolution_F16_SubState nextSubState;

    /* Check if the direct current interface is enabled or disabled */
    if (self->p_enableDirectInterface == true)
    {
        self->dqCommand.real = currentsDqRef.real;
        self->dqCommand.imag = currentsDqRef.imag;
    }
    else
    {
        /* Set dq ref current and iToF angle */
        Ifx_MS_FocSolution_F16_setDqCommand(self, iToFOutput);
    }

