Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
    /* Check the ref. speed to go to transition up or stay in open loop */
    if ((Ifx_Math_Abs_F16(self->rateLimitInSpeedQ15) > self->param->transitionSpeedUpQ15)
        && (self->p_status.actualControlMode == Ifx_MS_FocSolution_F16_ControlMode_foc))
    {
#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

        /* Init. transition counter */
        self->p_transitionCounter_cycles = 0U;

        /* Go to transition up */
        nextSubState = Ifx_MS_FocSolution_F16_SubState_transitionUp;
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_DIRECT_TRANSITION)

        /* Set the integral previous value to the configured transition q current */
        if (self->rateLimitInSpeedQ15 > 0)
        {
            Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->speedPi), self->param->qCurrentAtTransitionQ15);
        }
        else
        {
            Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->speedPi), Ifx_Math_Neg_F16(
                self->param->qCurrentAtTransitionQ15));
        }

        /* Set closed loop ramp up/down rates */
        Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&(self->accelerationLimit),
            self->param->speedRampUpRateClosedLoopQ30);
        Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&(self->accelerationLimit),
            self->param->speedRampDownRateClosedLoopQ30);

        /* Go to closed loop */
        nextSubState = Ifx_MS_FocSolution_F16_SubState_closedLoop;
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_DIRECT_TRANSITION) */
    }
    else
    {
        /* Stay in open loop */
        nextSubState = Ifx_MS_FocSolution_F16_SubState_openLoop;
    }

    return nextSubState;
}


static inline void Ifx_MS_FocSolution_F16_setDqCommand(Ifx_MS_FocSolution_F16* self, Ifx_MDA_IToFController_F16_Output
                                                       iToFOutput)
{
    /* Set ref. d current to I2f */
    self->dqCommand.real = iToFOutput.refCurrent.real;

    /* Set ref. q current to I2f depending on current and previous reference speed */
    Ifx_MS_FocSolution_F16_setQCommand(self, iToFOutput);

    /* Update previous ref. current */
    self->p_previousQCommand = self->dqCommand.imag;
}


static inline void Ifx_MS_FocSolution_F16_setQCommand(Ifx_MS_FocSolution_F16* self, Ifx_MDA_IToFController_F16_Output
                                                      iToFOutput)
{
    /* Effective Q command current */
    Ifx_Math_Fract16 effectiveRefQCurrent;
    effectiveRefQCurrent = Ifx_Math_RateLimit_F16_execute(&(self->p_startCurrentRateLimit),
        iToFOutput.refCurrent.imag);

    /* Set ref. q current to I2f depending on current and previous reference speed */
    if (self->rateLimitInSpeedQ15 >= 0)
    {
        self->dqCommand.imag = effectiveRefQCurrent;
    }
    else
    {
        self->dqCommand.imag = Ifx_Math_Neg_F16(effectiveRefQCurrent);
    }

    /* Detect if the current Q command changed sign */
    Ifx_MS_FocSolution_F16_detectQCommandZeroCross(self);
}


static inline void Ifx_MS_FocSolution_F16_detectQCommandZeroCross(Ifx_MS_FocSolution_F16* self)
{
    if (self->p_previousQCommand < 0)
    {
        if (self->dqCommand.imag > 0)
        {
            self->p_qCommandZeroCrossing = true;
        }
    }

    /* self->p_previousQCommand >= 0 */
    else
    {
        if (self->dqCommand.imag < 0)
        {
            self->p_qCommandZeroCrossing = true;
        }
    }
}


#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)
static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateTransitUp(Ifx_MS_FocSolution_F16* self,
                                                                                       Ifx_MDA_IToFController_F16_Output
                                                                                       iToFOutput, Ifx_Math_CmpFract16
                                                                                       currentsDqRef)
{
    Ifx_MS_FocSolution_F16_SubState nextSubState;

    /* Run smooth transition */
    bool                            mergeAngle;
    mergeAngle = Ifx_MS_FocSolution_F16_angleMergeCheck(self, iToFOutput, currentsDqRef);

    if (mergeAngle == true)
    {
        nextSubState = Ifx_MS_FocSolution_F16_subStateTransitUpExit(self, self->p_output.estimatedSpeedQ15,
            currentsDqRef);
    }
    else
    {
        nextSubState = Ifx_MS_FocSolution_F16_SubState_transitionUp;
    }

    return nextSubState;
}


static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateTransitUpExit(
    Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 estimatedSpeedQ15, Ifx_Math_CmpFract16 currentsDqRef)
{
    /* Calculate ref. Q current */
    self->dqCommand.imag = Ifx_MS_FocSolution_F16_currentQRef(self, estimatedSpeedQ15, currentsDqRef.imag);

    /* Set closed loop ramp up/down rates  */
    Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&(self->accelerationLimit),
        self->param->speedRampUpRateClosedLoopQ30);
    Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&(self->accelerationLimit),
        self->param->speedRampDownRateClosedLoopQ30);

    /* Go to closed loop */
    return Ifx_MS_FocSolution_F16_SubState_closedLoop;
}


static inline bool Ifx_MS_FocSolution_F16_angleMergeCheck(Ifx_MS_FocSolution_F16          * self,
                                                          Ifx_MDA_IToFController_F16_Output iToFOutput,
                                                          Ifx_Math_CmpFract16               currentsDqRef)
{
    /* Angle merge indication */
    bool    mergeAngle = false;

    /* Angle error between iToF and flux estimator */
    int32_t angleError = Ifx_MS_FocSolution_F16_angleError(self, iToFOutput);

    /* Check angle error minimum value and transition time */
    if ((Ifx_Math_Abs_F32(angleError) < self->param->transitionAngleTolerance)
        || (self->p_transitionCounter_cycles >= self->param->transitionTimeLimit_cycles - 1))
    {
        /* Set the integral previous value to the last reached ref. q current */
        Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->speedPi), self->dqCommand.imag);

        /* Set angle merge flag to true */
        mergeAngle = true;
    }

