Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
    /* Decrease ref. q current amplitude */
    else
    {
        /* Check if the direct current interface is enabled or disabled */
        if (self->p_enableDirectInterface == true)
        {
            self->dqCommand.real = currentsDqRef.real;
            self->dqCommand.imag = currentsDqRef.imag;
        }
        else
        {
            Ifx_MS_FocSolution_F16_decreaseQCurrent(self, iToFOutput);
        }
    }

    return mergeAngle;
}


static inline int32_t Ifx_MS_FocSolution_F16_angleError(Ifx_MS_FocSolution_F16          * self,
                                                        Ifx_MDA_IToFController_F16_Output iToFOutput)
{
    /* Get flux estimator output */
    Ifx_MDA_FluxEstimator_F16_Output fluxEstimatorOutput;
    Ifx_MDA_FluxEstimator_F16_getOutput(&(self->fluxEstimator), &fluxEstimatorOutput);

    /* I2f angle in uint16_t */
    uint16_t                         refAngle = (uint16_t)(iToFOutput.currentVecAngle_rad >> 16);

    /* FE angle in uint16_t */
    uint16_t                         estAngle = (uint16_t)(fluxEstimatorOutput.anglePLL >> 16);

    /* Angle error in int32_t */
    int32_t                          angleErr = (int32_t)refAngle - (int32_t)estAngle;

    /* Angle overflowed */
    int32_t                          outputAngle;

    /* Check if error > pi */
    if (angleErr > IFX_MATH_FRACT16_MAX)
    {
        outputAngle = Ifx_Math_Sub_F32(angleErr, IFX_MS_FOCSOLUTION_F16_2MAX);
    }

    /* Check if error < -pi */
    else if (angleErr < IFX_MS_FOCSOLUTION_F16_PINEG)
    {
        /* -1 is due to the asymmetry of the range on the negative (-32768) and positive (32767) limits */
        outputAngle = (Ifx_Math_Add_F32(angleErr, IFX_MS_FOCSOLUTION_F16_2MAX) - 1);
    }
    else
    {
        /* No wrapping needed, return the input */
        outputAngle = angleErr;
    }

    return outputAngle;
}


#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateClosedLoop(Ifx_MS_FocSolution_F16* self,
                                                                                        Ifx_Math_CmpFract16
                                                                                        currentsDqRef)
{
    Ifx_MS_FocSolution_F16_SubState nextSubState = Ifx_MS_FocSolution_F16_SubState_closedLoop;

    /* Store estimated speed and absolute estimated speed in local variables for further processing */
    Ifx_Math_Fract16                estimatedSpeedQ15    = self->p_output.estimatedSpeedQ15;
    Ifx_Math_Fract16                estimatedSpeedAbsQ15 = Ifx_Math_AbsSat_F16(estimatedSpeedQ15);

    /* Calculate ref. Q current */
    self->dqCommand.imag = Ifx_MS_FocSolution_F16_currentQRef(self, estimatedSpeedQ15, currentsDqRef.imag);

    if (estimatedSpeedAbsQ15 < self->transitionSpeedDownQ15)
    {
        /* Perform all required actions for exit from closedLoop and determine next subState */
        nextSubState = Ifx_MS_FocSolution_F16_subStateClosedLoopExit(self);
    }

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

    else if (estimatedSpeedAbsQ15 < self->transitionSpeedMidQ15)
    {
        Ifx_MS_FocSolution_F16_smoothTransitionDownCalc(self, estimatedSpeedAbsQ15);
    }

#endif /*(IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
    else
    {
        /* Set the direct real reference current (ready for field weakening) */
        self->dqCommand.real = currentsDqRef.real;
    }

    /* Return the substate for the next cycle */
    return nextSubState;
}


static inline Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateClosedLoopExit(
    Ifx_MS_FocSolution_F16* self)
{
    Ifx_MS_FocSolution_F16_SubState  nextSubState;
    Ifx_Math_Fract16                 estimatedSpeedQ15 = self->p_output.estimatedSpeedQ15;

    /* Get flux estimator output */
    Ifx_MDA_FluxEstimator_F16_Output fluxEstimator;
    Ifx_MDA_FluxEstimator_F16_getOutput(&(self->fluxEstimator), &fluxEstimator);

    /* Reset the iToF previous angle to last flux estimator angle */
    Ifx_MDA_IToFController_F16_setAnglePreviousValue(&(self->iToF), fluxEstimator.anglePLL);

    /* Reset the acceleration limit state to the last estimated speed */
    Ifx_Math_AccelLimit_F16_setSpeedStepPreviousValue(&(self->accelerationLimit), estimatedSpeedQ15);

    /* Set open loop ramp up/down rates */
    Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&(self->accelerationLimit), self->param->speedRampUpRateOpenLoopQ30);
    Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&(self->accelerationLimit),
        self->param->speedRampDownRateOpenLoopQ30);

    /* Store last ref. q current to calculate the slope in subStateTransitDown */
    self->p_previousQCommand = self->dqCommand.imag;

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

    /* Reset transition counter */
    self->p_transitionCounter_cycles = 0U;
    nextSubState                     = Ifx_MS_FocSolution_F16_SubState_transitionDown;
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */

#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_DIRECT_TRANSITION)

    nextSubState = Ifx_MS_FocSolution_F16_SubState_openLoop;
#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_DIRECT_TRANSITION) */

    return nextSubState;
}


static inline void Ifx_MS_FocSolution_F16_smoothTransitionDownCalc(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                   estimatedSpeedAbsQ15)
{
    /* Calculate the rate of the target d current based on the absolute estimated speed. The rate increases from 0.0 to
     * 1.0 as the speed decreases from the mid point between transitionSpeedUp and transitionSpeedDown
     * (transitionSpeedMid) to transitionSpeedDown. */
    Ifx_Math_Fract16 speedDifferenceQ15 = self->transitionSpeedMidQ15 - estimatedSpeedAbsQ15;
    Ifx_Math_Fract16 rate               = Ifx_Math_DivSat_F16(speedDifferenceQ15, self->p_transitionSpeedBandHalfQ15);

    /* Calculate Id */
    self->dqCommand.real = Ifx_Math_Mul_F16(rate, self->p_transitionDownTargetDCurrentQ15);
}


