Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
#if (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION)

/* *INDENT-OFF* */
static inline
Ifx_MS_FocSolution_F16_SubState Ifx_MS_FocSolution_F16_subStateTransitDown(Ifx_MS_FocSolution_F16* self,
                                                                           Ifx_MDA_IToFController_F16_Output iToFOutput,
                                                                           Ifx_Math_CmpFract16 currentsDqRef)
{
    Ifx_MS_FocSolution_F16_SubState nextSubState;

    /* Calculate the slope of the transition down based on the elapsed transition cycles */
    Ifx_Math_Fract16 transitionCounterQ15 = Ifx_Math_MulShR_F16((Ifx_Math_Fract16)self->p_transitionCounter_cycles,
        self->p_transitionDeltaQ15, 0U);

    if (self->p_transitionCounter_cycles < (self->param->transitionTimeLimit_cycles - 1U))
    {
        /* Increase amplitude of ref. Q current */
        Ifx_MS_FocSolution_F16_increaseQCurrent(self, iToFOutput, transitionCounterQ15);

        /* Decrease amplitude of ref. D current */
        Ifx_MS_FocSolution_F16_decreaseDCurrent(self, currentsDqRef.real, transitionCounterQ15);

        /* Increment transition counter */
        self->p_transitionCounter_cycles = self->p_transitionCounter_cycles + 1U;

        /* Stay in transition down */
        nextSubState = Ifx_MS_FocSolution_F16_SubState_transitionDown;
    }
    else
    {
        /* Store last ref. q current to check for addition of PI */
        self->p_previousQCommand = self->dqCommand.imag;

        /* Go to open loop */
        nextSubState = Ifx_MS_FocSolution_F16_SubState_openLoop;
    }

    return nextSubState;
}
/* *INDENT-ON* */
static inline void Ifx_MS_FocSolution_F16_increaseQCurrent(Ifx_MS_FocSolution_F16                * self,
                                                           Ifx_MDA_IToFController_F16_Output const iToFOutput,
                                                           Ifx_Math_Fract16 const
                                                           transitionCounterQ15)
{
    /* Increase amplitude of positive imaginary ref. current at slope defined */
    if (self->rateLimitInSpeedQ15 >= 0)
    {
        /* Store delta between i2f q current and last ref. q current from PI based on sign ref. speed */
        Ifx_Math_Fract16 currDeltaQ15 = Ifx_Math_SubSat_F16(iToFOutput.refCurrent.imag, self->p_previousQCommand);

        /* Increase amplitude of ref. q current */
        self->dqCommand.imag = Ifx_Math_AddSat_F16(self->p_previousQCommand, Ifx_Math_Mul_F16(transitionCounterQ15,
            currDeltaQ15));
    }

    /* Increase amplitude of negative imaginary ref. current at slope defined */
    else
    {
        /* Store delta between i2f q current and last ref. q current from PI based on sign ref. speed */
        Ifx_Math_Fract16 currDeltaQ15 = Ifx_Math_AddSat_F16(iToFOutput.refCurrent.imag, self->p_previousQCommand);

        /* Increase amplitude of ref. q current */
        self->dqCommand.imag = Ifx_Math_SubSat_F16(self->p_previousQCommand, Ifx_Math_Mul_F16(transitionCounterQ15,
            currDeltaQ15));
    }
}


static inline void Ifx_MS_FocSolution_F16_decreaseQCurrent(Ifx_MS_FocSolution_F16                * self,
                                                           Ifx_MDA_IToFController_F16_Output const iToFOutput)
{
    /* Increment transition counter */
    self->p_transitionCounter_cycles = self->p_transitionCounter_cycles + 1u;

    /* Slope to increase or decrease the currents */
    Ifx_Math_Fract16 slope = Ifx_Math_DivShLSat_F16((Ifx_Math_Fract16)self->p_transitionCounter_cycles,
        (Ifx_Math_Fract16)self->param->transitionTimeLimit_cycles, 15U);

    /* Decrease amplitude of positive imaginary ref. current at slope defined */
    if (self->rateLimitInSpeedQ15 >= 0)
    {
        self->dqCommand.imag = Ifx_Math_SubSat_F16(iToFOutput.refCurrent.imag, Ifx_Math_Mul_F16(slope,
            iToFOutput.refCurrent.imag));
    }

    /* Decrease amplitude of negative imaginary ref. current at slope defined */
    else
    {
        self->dqCommand.imag = Ifx_Math_SubSat_F16(Ifx_Math_Mul_F16(slope, iToFOutput.refCurrent.imag),
            iToFOutput.refCurrent.imag);
    }
}


static inline void Ifx_MS_FocSolution_F16_decreaseDCurrent(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 const
                                                           currentDRefQ15, Ifx_Math_Fract16 const
                                                           transitionCounterQ15)
{
    /* Calculate difference between target D current during transition down and reference D current */
    Ifx_Math_Fract16 currentDDiffQ15 = Ifx_Math_Sub_F16(self->p_transitionDownTargetDCurrentQ15, currentDRefQ15);

    /* Decrease Id from the target Id current for transition down to the input d command */
    self->dqCommand.real = Ifx_Math_Sub_F16(self->p_transitionDownTargetDCurrentQ15, Ifx_Math_Mul_F16(
        transitionCounterQ15, currentDDiffQ15));
}


#endif /* (IFX_MS_FOCSOLUTION_F16_CFG_TRANSITION_MODE == IFX_MS_FOCSOLUTION_F16_TRANSITION_MODE_SMOOTH_TRANSITION) */
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateFault(Ifx_MS_FocSolution_F16* self)
{
    Ifx_MS_FocSolution_F16_State nextState;
    bool                         faultCleared;

    /* Check whether clear fault state is requested */
    if (self->p_clearFaultIsRequested == true)
    {
        /* Check whether all faults in the underlying modules have been successfully cleared */
        faultCleared = Ifx_MS_FocSolution_F16_faultSuccessfullyCleared(self);

        if (faultCleared == true)
        {
            /* Disable underlying modules and go to off state */
            Ifx_MS_FocSolution_F16_localEnable(self, false);
            nextState = Ifx_MS_FocSolution_F16_State_off;
        }
        else
        {
            /* Fault of an underlying module has not been successfully cleared, stay in fault state */
            nextState = Ifx_MS_FocSolution_F16_State_fault;
        }
    }
    else
    {
        /* No clear fault requested, stay in fault state */
        nextState = Ifx_MS_FocSolution_F16_State_fault;
    }

    return nextState;
}


static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateRampDown(Ifx_MS_FocSolution_F16* self, bool
                                                                                faultStatus, Ifx_Math_CmpFract16
                                                                                currentsDqRef)
{
    Ifx_MS_FocSolution_F16_State nextState;

    /* Perform speed and acceleration limit */
    Ifx_MS_FocSolution_F16_limitSpeed(self, 0);

    if (faultStatus == true)
    {
        /* Disable flux estimator */
        Ifx_MDA_FluxEstimator_F16_configMode(&(self->fluxEstimator), Ifx_MDA_FluxEstimator_F16_Mode_disable);

        /* Go into fault state */
        nextState = Ifx_MS_FocSolution_F16_State_fault;
    }
    else if (Ifx_Math_Abs_F16(self->rateLimitInSpeedQ15) <= self->param->minimumSpeedThresholdQ15)
    {
        /* Disable flux estimator */
        Ifx_MDA_FluxEstimator_F16_configMode(&(self->fluxEstimator), Ifx_MDA_FluxEstimator_F16_Mode_disable);
        nextState = Ifx_MS_FocSolution_F16_State_standBy;
    }
    else
    {
        /* Execute sub-state machine */
        Ifx_MS_FocSolution_F16_subStateMachine(self, currentsDqRef);
        nextState = Ifx_MS_FocSolution_F16_State_rampDown;
    }

    return nextState;
}


static inline bool Ifx_MS_FocSolution_F16_anyClearFaultIsPending(Ifx_MS_FocSolution_F16* self)
{
    /* Holds the overall result of the underlying modules clearFaultIsPending */
    bool clearFaultIsPending = false;

    /* MHA modules fault is pending */
    clearFaultIsPending = Ifx_MHA_DriverGroup_F16_anyClearFaultIsPending(&(self->driverGroup));

    /* Modulator fault is pending */
    if (Ifx_MAS_Modulator_F16_clearFaultIsPending(&(self->modulator)) == true)
    {
        clearFaultIsPending = true;
    }

#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1

    /* StartAngleIdent fault is pending */
    else if (Ifx_MDA_StartAngleIdent_F16_clearFaultIsPending(&(self->startAngleIdent)) == true)
    {
        clearFaultIsPending = true;
    }
#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
    else
    {
        /* No operation */
    }

    /* Return whether clear fault of any underlying module is still pending */
    return clearFaultIsPending;
}


