Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
static inline bool Ifx_MS_FocSolution_F16_faultSuccessfullyCleared(Ifx_MS_FocSolution_F16* self)
{
    bool faultCleared;

    /* Check that none of the clear fault requests in the underlying modules are pending */
    if (Ifx_MS_FocSolution_F16_anyClearFaultIsPending(self) == false)
    {
        /* Check for faults in underlying modules */
        if (Ifx_MS_FocSolution_F16_faultStatus(self) == true)
        {
            faultCleared = false;
        }

        /* No faults detected any more, fault(s) successfully cleared */
        else
        {
            faultCleared = true;
        }

        /* Reset the clear fault requested flag */
        self->p_clearFaultIsRequested = false;
    }
    else
    {
        /* Clear fault has not finished execution in every module yet */
        faultCleared = false;
    }

    return faultCleared;
}


#if IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1
static inline Ifx_MS_FocSolution_F16_State Ifx_MS_FocSolution_F16_stateStartAngleIdent(Ifx_MS_FocSolution_F16* self,
                                                                                       Ifx_Math_Fract16 speedQ15, bool
                                                                                       faultStatus,
                                                                                       Ifx_MDA_IToFController_F16_Output
                                                                                       iToFOutput)
{
    Ifx_MS_FocSolution_F16_State       nextState;

    /* Get the status of the start angle estimation */
    Ifx_MDA_StartAngleIdent_F16_Status startAngleEstStatus = Ifx_MDA_StartAngleIdent_F16_getStatus(
        &(self->startAngleIdent));

    if (faultStatus == true)
    {
        /* Go to fault */
        nextState = Ifx_MS_FocSolution_F16_State_fault;
    }
    else if (startAngleEstStatus.state == Ifx_MDA_StartAngleIdent_F16_State_estimationReady)
    {
        /* Disable start angle ident. module */
        Ifx_MDA_StartAngleIdent_F16_enable(&(self->startAngleIdent), false);

        /* Stay in start angle ident. state */
        nextState = Ifx_MS_FocSolution_F16_State_startAngleIdent;
    }
    else if (startAngleEstStatus.state == Ifx_MDA_StartAngleIdent_F16_State_off)
    {
        /* Variable to store start angle identification output */
        Ifx_MDA_StartAngleIdent_F16_Output startAngleIdentOutput;

        /* Get start angle identification output */
        Ifx_MDA_StartAngleIdent_F16_getOutput(&(self->startAngleIdent), &startAngleIdentOutput);

        /* Init i2f angle prev value */
        Ifx_MS_FocSolution_F16_setAnglePreviousValue(self, speedQ15, startAngleIdentOutput);

        if (self->p_enableControl == true)
        {
            /* Update control mode */
            self->p_status.actualControlMode = Ifx_MS_FocSolution_F16_getControlMode(self);

            /* Set Q command current */
            self->dqCommand.imag = iToFOutput.refCurrent.imag;

            /* Set open loop ramp up/down rates */
            Ifx_Math_AccelLimit_F16_setSpeedStepUpLimit(&(self->accelerationLimit),
                self->param->speedRampUpRateOpenLoopQ30);
            Ifx_Math_AccelLimit_F16_setSpeedStepDownLimit(&(self->accelerationLimit),
                self->param->speedRampDownRateOpenLoopQ30);

            /* Init. substate machine */
            self->p_status.subState = Ifx_MS_FocSolution_F16_SubState_openLoop;

            /* Enable flux estimator */
            Ifx_MDA_FluxEstimator_F16_configMode(&(self->fluxEstimator), Ifx_MDA_FluxEstimator_F16_Mode_enable);

            /* If estimation is done and speed control is enabled, store estimated angle and go to run */
            nextState = Ifx_MS_FocSolution_F16_State_run;
        }
        else
        {
            nextState = Ifx_MS_FocSolution_F16_State_standBy;
        }
    }
    else
    {
        /* Stay in start angle ident. state */
        nextState = Ifx_MS_FocSolution_F16_State_startAngleIdent;
    }

    return nextState;
}


void Ifx_MS_FocSolution_F16_setAnglePreviousValue(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 speedQ15,
                                                  Ifx_MDA_StartAngleIdent_F16_Output startAngleIdentOutput)
{
    /* Init i2f angle prev value */
    if (speedQ15 > 0)
    {
        Ifx_MDA_IToFController_F16_setAnglePreviousValue(&(self->iToF), startAngleIdentOutput.estimatedAngle -
            IFX_MS_FOCSOLUTION_F16_PIBY2 + IFX_MS_FOCSOLUTION_F16_PIBY6);
    }
    else if (speedQ15 < 0)
    {
        Ifx_MDA_IToFController_F16_setAnglePreviousValue(&(self->iToF), startAngleIdentOutput.estimatedAngle -
            IFX_MS_FOCSOLUTION_F16_PIBY2 - IFX_MS_FOCSOLUTION_F16_PIBY6);
    }
    else
    {
        Ifx_MDA_IToFController_F16_setAnglePreviousValue(&(self->iToF), startAngleIdentOutput.estimatedAngle -
            IFX_MS_FOCSOLUTION_F16_PIBY2);
    }
}


#endif /* IFX_MS_FOCSOLUTION_F16_CFG_INCLUDE_STARTANGLE_IDENT == 1 */
static void Ifx_MS_FocSolution_F16_reset(Ifx_MS_FocSolution_F16* self)
{
    /* Flux estimator */
    Ifx_Math_LowPass1st_F16_setPreviousValue(&(self->fluxEstimator.p_alphaFilter), 0);
    Ifx_Math_LowPass1st_F16_setPreviousValue(&(self->fluxEstimator.p_betaFilter), 0);
    Ifx_Math_LowPass1st_F16_setPreviousValue(&(self->fluxEstimator.p_speedFilter), 0);
    Ifx_Math_PLL_F16_resetBuffer(&self->fluxEstimator.p_pllFilter);
    Ifx_Math_PLL_F16_setPreviousValue(&self->fluxEstimator.p_pllFilter, 0);

    /* PI controller */
    Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->speedPi), 0);

    /* Field oriented controller */
    Ifx_MDA_FocController_F16_reset(&(self->focController));

    /* Acceleration limiter and I2f */
    Ifx_Math_AccelLimit_F16_setSpeedStepPreviousValue(&(self->accelerationLimit), 0);
    Ifx_Math_RateLimit_F16_setPreviousValue(&(self->p_startCurrentRateLimit), self->param->initStartupCurrentQ15);

    /* Set the initial startup current to the statically configured value */
    self->dqCommand.imag = self->param->initStartupCurrentQ15;

    /* Speed and sector number */
    self->rateLimitInSpeedQ15                      = 0;
    self->previousCurrentReconstructionInfo.sector = 0;
}


void Ifx_MS_FocSolution_F16_setTransitionTimeLimit(Ifx_MS_FocSolution_F16* self, uint16_t transitionTimeLimit_cycles)
{
    self->param->transitionTimeLimit_cycles = transitionTimeLimit_cycles;
    Ifx_MS_FocSolution_F16_p_setTransitionDelta(self, transitionTimeLimit_cycles);
}


static inline void Ifx_MS_FocSolution_F16_p_setTransitionDelta(Ifx_MS_FocSolution_F16* self, uint16_t
                                                               transitionTimeLimit_cycles)
{
    if (transitionTimeLimit_cycles > (uint16_t)IFX_MATH_FRACT16_MAX)
    {
        self->p_transitionDeltaQ15 = 1;
    }
    else
    {
        self->p_transitionDeltaQ15 = Ifx_Math_DivShL_F16(IFX_MATH_FRACT16_MAX,
            (Ifx_Math_Fract16)transitionTimeLimit_cycles, 0U);
    }
}


void Ifx_MS_FocSolution_F16_setTransitionSpeedUp(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 transitionSpeedUpQ15)
{
    /* Set the internal parameter */
    self->param->transitionSpeedUpQ15 = transitionSpeedUpQ15;

    /* Calculate dependent transition speed parameters */
    Ifx_MS_FocSolution_F16_p_calcInternalTransitionSpeeds(self);
}


