Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MS_FocSolution_F16.c
void Ifx_MS_FocSolution_F16_setTransitionSpeedBand(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                   transitionSpeedBandQ15)
{
    /* Set the internal parameter */
    self->param->transitionSpeedBandQ15 = transitionSpeedBandQ15;

    /* Calculate dependent transition speed parameters */
    Ifx_MS_FocSolution_F16_p_calcInternalTransitionSpeeds(self);
}


static inline void Ifx_MS_FocSolution_F16_p_calcInternalTransitionSpeeds(Ifx_MS_FocSolution_F16* self)
{
    /* Set the transition speed down */
    self->transitionSpeedDownQ15 = self->param->transitionSpeedUpQ15 - self->param->transitionSpeedBandQ15;

    /* Set the middle transition speed */
    self->transitionSpeedMidQ15 = self->transitionSpeedDownQ15 + Ifx_Math_ShR_F16(self->param->transitionSpeedBandQ15,
        1);

    /* Set half of the speed band */
    self->p_transitionSpeedBandHalfQ15 = Ifx_Math_ShR_F16(self->param->transitionSpeedBandQ15, 1);
}


void Ifx_MS_FocSolution_F16_setStartUpCurrent(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16 startUpCurrentQ15)
{
    /* Set the startup current in the parameter struct */
    self->param->startUpCurrentQ15 = startUpCurrentQ15;

    /* Set the startup current */
    Ifx_MDA_IToFController_F16_setReferenceCurrentImag(&(self->iToF), startUpCurrentQ15);

    /* Set the D current for smooth transition */
    Ifx_MS_FocSolution_F16_p_setTransitionDownTargetDCurrentQ15(self);
}


void Ifx_MS_FocSolution_F16_setTransitionDownDCurrentScalingQ14(Ifx_MS_FocSolution_F16* self, Ifx_Math_Fract16
                                                                transitionDownDCurrentScalingQ14)
{
    if (transitionDownDCurrentScalingQ14 < 0)
    {
        self->param->transitionDownDCurrentScalingQ14 = 0;
    }
    else
    {
        self->param->transitionDownDCurrentScalingQ14 = transitionDownDCurrentScalingQ14;
    }

    /* Set the D current for smooth transition */
    Ifx_MS_FocSolution_F16_p_setTransitionDownTargetDCurrentQ15(self);
}


static inline void Ifx_MS_FocSolution_F16_p_setTransitionDownTargetDCurrentQ15(Ifx_MS_FocSolution_F16* self)
{
    /* Set the D current for smooth transition */
    self->p_transitionDownTargetDCurrentQ15 = Ifx_Math_MulShRSat_F16(self->param->startUpCurrentQ15,
        self->param->transitionDownDCurrentScalingQ14, 14U);
}


void Ifx_MS_FocSolution_F16_setSpeedPiPropGain(Ifx_MS_FocSolution_F16* self, uint32_t propGain)
{
    /* Set internal parameter */
    self->param->speedPiPropGain = propGain;

    /* Get the gain in Q format */
    Ifx_Math_Fract16Q propGainQ = Ifx_Math_ConvToQForm_F16(propGain, IFX_MS_FOCSOLUTION_F16_DEC_PLACES);

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setPropGain(&(self->speedPi), propGainQ);
}


uint32_t Ifx_MS_FocSolution_F16_getSpeedPiPropGain(Ifx_MS_FocSolution_F16* self)
{
    return self->param->speedPiPropGain;
}


void Ifx_MS_FocSolution_F16_setSpeedPiIntegGainSamplingTime(Ifx_MS_FocSolution_F16* self, uint32_t
                                                            integGainSamplingTime)
{
    /* Set internal parameter */
    self->param->speedPiIntegGainSamplingTime = integGainSamplingTime;

    /* Get the gain in Q format */
    Ifx_Math_Fract16Q integGainSamplingTimeQ = Ifx_Math_ConvToQForm_F16(integGainSamplingTime,
        IFX_MS_FOCSOLUTION_F16_DEC_PLACES);

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(&(self->speedPi), integGainSamplingTimeQ);
}


uint32_t Ifx_MS_FocSolution_F16_getSpeedPiIntegGainSamplingTime(Ifx_MS_FocSolution_F16* self)
{
    return self->param->speedPiIntegGainSamplingTime;
}
